import React from "react";
import "../styles/AstrologyAdvice.css";
import Footer from "./Footer";

function AstrologyAdvice() {
  const advices = [
    {
      id: 0,
      title: "व्याख्या",
      description:
        "समयरेखा की व्याख्या व्यक्ति के जीवन का एक अवलोकन मात्र है जैसे कि आने वाले समय में उसके पास क्या होने वाला है। वैदिक ज्योतिष में कुंडली में ग्रहों की स्थिति के आधार पर जीवन की व्याख्या की जाती है। एक अच्छी तरह से प्रशिक्षित ज्योतिषी कुंडली चार्ट में सितारों और ग्रहों के सभी विन्यासों का सावधानीपूर्वक विश्लेषण करता है ताकि इससे सबसे अच्छा निष्कर्ष निकाला जा सके। एक जानकार ज्योतिषी शादी के समयए करियर के उतार.चढ़ाव और यहां तक ​​कि व्यक्ति से संबंधित स्वास्थ्य संबंधी मुद्दों की व्याख्या कर सकता है।",
    },
    {
      id: 1,
      title: "मुहुर्त",
      description:
        "जब कोई नया काम शुरू करने जा रहे होंए तो वह कोई नया व्यवसायए विवाह या कोई भी आध्यात्मिक घटना हो सकती हैए ज्योतिषियों से मुहूर्त पूछा जाता हैए ताकि काम सुचारू रूप से चले और सफलतापूर्वक समाप्त हो जाए। यह वह समय है जब ग्रहों की स्थिति सबसे सुविधाजनक और अनुकूल होती है।",
    },
    {
      id: 2,
      title: "कैरियर परामर्श",
      description:
        "इसका सीधा सा मतलब है कि ग्रहों की स्थिति के अनुसार व्यक्ति का करियर कैसा रहेगा। ग्रहों की स्थिति के संबंध मेंए व्यक्ति के करियर ग्राफ और चुनी जाने वाली स्ट्रीम को आंका जाता है। हम में से अधिकांशए अपनी छोटी उम्र से ही अपने लिए सबसे अच्छा करियर चुनने के लिए परेशान रहते हैंए वैदिक ज्योतिष आपको बताता है कि कौन सा पेशा आपको सबसे अच्छा परिणाम देगा और कौन सा काम आपको रुचि के साथ काम करने की अनुमति देगा। आप यह भी जान सकते हैं कि वैदिक ज्योतिष में करियर परामर्श से आप व्यवसाय में अच्छे होंगे या नौकरी में।",
    },
    {
      id: 3,
      title: "प्रश्न कुंडली",
      description:
        "प्रश्न कुंडली ज्योतिष प्रणाली की एक अलग शैली हैए जो कुंडली चार्ट प्रणाली से अलग है। इसका किसी की कुंडली से कोई संबंध नहीं है। इसका उपयोग तब किया जाता है जब व्यक्ति अपना जन्म विवरण प्राप्त करने में असमर्थ होता है। प्रश्न कुण्डली व्यक्ति की कुंडली तक पहुँचने के बजाय मूल रूप से व्यक्ति द्वारा पूछे गए प्रश्न की कुण्डली होती है।",
    },
  ];

  return (
    <div className="AstrologyAdvicecontainer">
      <div className="AstrologyAdvicebannerContainer">
        <h1>We Offer The Following</h1>
        <h1>Astrology Consultation Services</h1>
      </div>
      <div className="AstrologyAdviceBox">
        {advices.map((ad) => (
          <div key={ad.id} className="AstrologyAdviceContainer">
            <div className="box" />
            <h1>{ad.title}</h1>
            <p>{ad.description}</p>
          </div>
        ))}
      </div>
      <Footer />
    </div>
  );
}

export default AstrologyAdvice;
